snlkuharlocal/src/Documents/Табель/Табель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Табель</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСотрудников</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>EnumRef.СостояниеТабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Переработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСмены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСмены</name>
      <type>
        <types>EnumRef.СостояниеТабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Вход</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выход</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработанноеВремя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыЗаДень</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыСКУД1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроходыСКУД2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереработкаСКУД</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СостояниеТабеля/СостояниеТабеля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеТабеля</name>
  <enumValues>
    <name>ДневнаяСмена</name>
    <comment>Дневная смена</comment>
  </enumValues>
  <enumValues>
    <name>НочнаяСмена</name>
    <comment>Ночная смена</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДень1</name>
    <comment>Первая смена</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДень2</name>
    <comment>Вторая смена</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДеньНочнаяСмена</name>
    <comment>Ночная смена</comment>
  </enumValues>
  <enumValues>
    <name>ВыходнойДень</name>
    <comment>Выходной день</comment>
  </enumValues>
  <enumValues>
    <name>Больничный</name>
    <comment>Больничный лист</comment>
  </enumValues>
  <enumValues>
    <name>ОтпускОчередной</name>
    <comment>Отпуск очередной</comment>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохранения</name>
    <comment>Отпуск без сохранения з/п (за свой счет)</comment>
  </enumValues>
  <enumValues>
    <name>Невыход</name>
    <comment>Невыход (по невыясненным прихинам)</comment>
  </enumValues>
  <enumValues>
    <name>Декрет</name>
    <comment>Декретный отпуск</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительныйЛьготныйДень</name>
    <comment>Дополнительный льготный день (для инвалидов)</comment>
  </enumValues>
  <enumValues>
    <name>РаботаВПраздники</name>
    <comment>Работа в праздничный (выходной) день</comment>
  </enumValues>
  <enumValues>
    <name>ОтпускВСчетОтработанногоВыходного</name>
    <comment>Отпуск в счет отработанного выходного</comment>
  </enumValues>
  <enumValues>
    <name>ВремяИсполненияГосударственныхОбязанностей</name>
    <comment>Время исполнения государственных обязанностей</comment>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
    <comment>Командировка</comment>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
    <comment>Прогул</comment>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
    <comment>Уволен</comment>
  </enumValues>
  <enumValues>
    <name>РабочийДень</name>
    <comment>Рабочий день</comment>
  </enumValues>
  <enumValues>
    <name>Переработки</name>
  </enumValues>
  <enumValues>
    <name>ПриостановлениеДоговора</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Табель/Forms/Сотрудник/Module.bsl
&НаСервереБезКонтекста
Функция РазложитьСтрокуВМассивПодстрок1(Знач Значение, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
	СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Если Разделитель = "," 
		И ПропускатьПустыеСтроки = Неопределено 
		И СокращатьНепечатаемыеСимволы Тогда 
		
		Результат = СтрРазделить(Значение, ",", Ложь);
		Для Индекс = 0 По Результат.ВГраница() Цикл
			Результат[Индекс] = СокрЛП(Результат[Индекс])
		КонецЦикла;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Значение) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = СтрНайти(Значение, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Значение, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайти(Значение, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Значение));
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаСервереБезКонтекста
Функция СтрокаПроходыВСтруктуру(МассивПроходы,ТипСмены)           
	тз=Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Номер",Новый ОписаниеТипов("Число",
	Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Любой)));
	тз.Колонки.Добавить("Вход", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.Время)));
	тз.Колонки.Добавить("Выход", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.Время)));
	тз.Колонки.Добавить("Отработано", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.Время)));
	тз.Колонки.Добавить("Отсутствие", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.Время)));
	
	Индекс = -1;
	НовыйМассив = Новый Массив;  
	Добавлено = Ложь;                   
	Отработано=0;
	Для каждого ЭлементМассива Из МассивПроходы Цикл      
		Индекс = Индекс + 1;                
		Если Не Добавлено Тогда
			НоваяСтрока = тз.Добавить();      
			НоваяСтрока.Номер = тз.Индекс(НоваяСтрока)+1;
			Если СтрНайти(ЭлементМассива,"вход")>0 Тогда
				НоваяСтрока.Вход = СтрокаВоВремя(ЭлементМассива);     
				Добавлено=Истина;
			Иначе	
				НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива);                
				Если НЕ НоваяСтрока.Вход=Дата(1,1,1) И НЕ НоваяСтрока.Выход=Дата(1,1,1) Тогда
					СтруктураОтработано = ЧислоВоВремя(?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход));
					НоваяСтрока.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0);
					Отработано = Отработано + ?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход);
				КонецЕсли;
				Добавлено=Ложь;
			КонецЕсли;
		Иначе          
			Если СтрНайти(ЭлементМассива,"выход")>0 Тогда
				НоваяСтрока.Выход = СтрокаВоВремя(ЭлементМассива);     
				Добавлено=Ложь;                   
				Если НЕ НоваяСтрока.Вход=Дата(1,1,1) И НЕ НоваяСтрока.Выход=Дата(1,1,1) Тогда
					СтруктураОтработано = ЧислоВоВремя(?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход));
					НоваяСтрока.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0);
					Отработано = Отработано + ?(НоваяСтрока.Выход < НоваяСтрока.Вход,НоваяСтрока.Выход - НоваяСтрока.Вход+86400,НоваяСтрока.Выход - НоваяСтрока.Вход);
				КонецЕсли;
			Иначе
				НоваяСтрока = тз.Добавить();  
				НоваяСтрока.Номер = тз.Индекс(НоваяСтрока)+1;
				НоваяСтрока.Вход = СтрокаВоВремя(ЭлементМассива);     
				Добавлено=Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;             
	Отсутствие = 0;
	Для каждого СтрокаТЗ Из тз Цикл    
		Если НЕ тз.Индекс(СтрокаТЗ) = тз.Количество() - 1 Тогда           
			Если НЕ тз[тз.Индекс(СтрокаТЗ)+1].Вход=Дата(1,1,1) И НЕ СтрокаТЗ.Выход=Дата(1,1,1) Тогда
				СтруктураОтсутствие = ЧислоВоВремя(?(тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход < 0,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход + 86400,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход));  
				СтрокаТЗ.Отсутствие = Дата(1,1,1,СтруктураОтсутствие.Часы, СтруктураОтсутствие.Минуты,0);
				Отсутствие =  ?(тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход < 0,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход + 86400,тз[тз.Индекс(СтрокаТЗ)+1].Вход - СтрокаТЗ.Выход)  + Отсутствие;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Ошибки=Ложь;
	Для каждого СтрокаТЗ Из тз Цикл    
		Если СтрокаТЗ.Вход=Дата(1,1,1) ИЛИ СтрокаТЗ.Выход=Дата(1,1,1) Тогда
			Ошибки = Истина;    
			Прервать;
		КонецЕсли;
	КонецЦикла;           
	
	ВремяВхода = тз[0].Вход;
	ВремяВыхода = тз[тз.Количество() - 1].Выход;   
	Возврат Новый Структура("тз, Отработано, Отсутствие, Состояние, ВремяВхода, ВремяВыхода, Ошибки",тз,Отработано, Отсутствие, ТипСмены, ВремяВхода, ВремяВыхода, Ошибки);
	
КонецФункции

&НаСервереБезКонтекста
Функция СтрокаВоВремя(Строка) 
	
	СтрВремя = СтрЗаменить(СтрЗаменить(Строка," вход","")," выход","");
	МассивВремя = РазложитьСтрокуВМассивПодстрок1(СтрВремя,":");
	ВремяЧас = Число(МассивВремя[0]);
	ВремяМин = Число(МассивВремя[1]);
	Время = Дата(1,1,1,ВремяЧас,ВремяМин,0);
	
	Возврат Время;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЧислоВоВремя(Знач КоличествоСекунд)
	
	Перем Часы, Минуты, Секунды;
	
	//получаем часы
	Часы = Цел(КоличествоСекунд / 3600);
	//считаем остаток
	КоличествоСекунд = КоличествоСекунд % 3600;
	//получаем минуты
	Минуты = Цел(КоличествоСекунд / 60);//в минуте 60 сек
	//остались секунды
	Секунды = КоличествоСекунд % 60;
	
	Возврат Новый Структура("Часы, Минуты, Секунды", Часы, Минуты, Секунды);
	//Возврат Строка(Часы)+" ч. " + Строка(Минуты) + " мин.";
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивВСтроку(Массив) 
	МассивСтрокой ="";
	Индекс = 0;
	Для каждого ЭлементМассива Из Массив Цикл
		Индекс = Индекс+1;
		Если Индекс = Массив.Количество() Тогда
			МассивСтрокой = МассивСтрокой + ЭлементМассива;	
		Иначе		
			МассивСтрокой = МассивСтрокой + ЭлементМассива + Символы.ПС;	
		КонецЕсли;
	КонецЦикла;
	Возврат МассивСтрокой;
КонецФункции

&НаСервереБезКонтекста
Функция ПроходыНочнойСмены(Проходы1,Проходы2) 
	//Пытаемся отсечь проходы следующей ночной смены
	ПроходыДоКонцаСмены = Новый Массив;  
	ИндексЭлемента =-1;
	МассивПроходов = РазложитьСтрокуВМассивПодстрок1(Проходы2,Символы.ПС);
	Для каждого ЭлементМассива Из МассивПроходов Цикл
		ИндексЭлемента =ИндексЭлемента + 1;
		ИндексСледующегоЭлемента =ИндексЭлемента + 1;
		ВремяПрохода = СтрокаВоВремя(ЭлементМассива);
		ПроходыДоКонцаСмены.Добавить(ЭлементМассива);
		Если НЕ ИндексСледующегоЭлемента= МассивПроходов.Количество() Тогда
			ВремяСледующегоПрохода = СтрокаВоВремя(МассивПроходов[ИндексСледующегоЭлемента]);	  
			Если ВремяСледующегоПрохода - ВремяПрохода > 8*3600 Тогда
				Прервать;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Пытаемся добавить проходы ночной смены до 00 часов
	МассивПроходов = РазложитьСтрокуВМассивПодстрок1(Проходы1,Символы.ПС);              
	ИндексПоследнего = МассивПроходов.ВГраница();
	
	Для Индекс = -ИндексПоследнего По 0 Цикл
		Значение = МассивПроходов[-Индекс];
		
		Время = СтрокаВоВремя(Значение);
		Если НЕ (-Индекс-1<0) Тогда
			СледующееЗначение = МассивПроходов[-Индекс-1];
			ПредыдущееВремя = СтрокаВоВремя(СледующееЗначение);
			ч=0;
			Если Время-ПредыдущееВремя < 8*3600 ИЛИ Индекс = 0 Тогда
				ПроходыДоКонцаСмены.Вставить(0,Значение);
			Иначе
				ПроходыДоКонцаСмены.Вставить(0,Значение);
				Прервать;
			КонецЕсли;
		Иначе	
			ПроходыДоКонцаСмены.Вставить(0,Значение);
		КонецЕсли;
	КонецЦикла;			
	Возврат ПроходыДоКонцаСмены;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	Если ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда     
		МассивПроходов = ПроходыНочнойСмены(Проходы1,Проходы2);
	Иначе
		МассивПроходов = РазложитьСтрокуВМассивПодстрок1(Проходы1, Символы.ПС);
	КонецЕсли;
	СтруктураПроходов = СтрокаПроходыВСтруктуру(МассивПроходов,ТипСмены);
	ЗначениеВРеквизитФормы(СтруктураПроходов.тз,"тзПроходы");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();     
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Ошибки = Ложь;
	Для каждого СтрокаТЗ Из тзПроходы Цикл
		Если СтрокаТЗ.Вход =Дата(1,1,1) ИЛИ СтрокаТЗ.Выход =Дата(1,1,1) Тогда
			Ошибки = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;                         
	Закрыть(Новый Структура("СменаТабель", Смена));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Сотрудник") Тогда    
		Элементы.Сотрудник.Заголовок = Параметры.Сотрудник;  
		Сотрудник = СокрЛП(Параметры.Сотрудник); 
	КонецЕсли;            
	Если Параметры.Свойство("Смена") Тогда    
		ЭтотОбъект.Смена = Параметры.Смена; 
	КонецЕсли;            
	
	Строка = тзИтоги.Добавить();
	Строка.Заголовок = "Табель";
	Строка.Смена = ЭтотОбъект.Смена;   
КонецПроцедуры   

&НаКлиенте
Процедура тзПроходыВыходПриИзменении(Элемент)     
	ТекущиеДанные = Элементы.тзПроходы.ТекущиеДанные;        
	ПересчитатьСтрокуВыход(ТекущиеДанные);    
	ПересчитатьИтоги();
КонецПроцедуры       

&НаКлиенте
Процедура ПересчитатьСтрокуВыход(ТекущиеДанные) 
	Если НЕ ТекущиеДанные.Вход = Дата(1,1,1) И НЕ ТекущиеДанные.Выход = Дата(1,1,1) Тогда
		СтруктураОтработано = ЧислоВоВремя(?(ТекущиеДанные.Выход < ТекущиеДанные.Вход,ТекущиеДанные.Выход - ТекущиеДанные.Вход+86400,ТекущиеДанные.Выход - ТекущиеДанные.Вход));
		ТекущиеДанные.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0);
		Если НЕ тзПроходы.Индекс(ТекущиеДанные) = тзПроходы.Количество() - 1 Тогда
			СтруктураОтсутствие = ЧислоВоВремя(?(тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход < 0,тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход + 86400,тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход));  
			ТекущиеДанные.Отсутствие = Дата(1,1,1,СтруктураОтсутствие.Часы, СтруктураОтсутствие.Минуты,0);
		КонецЕсли;
	КонецЕсли;             
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуВход(ТекущиеДанные) 
	Если НЕ ТекущиеДанные.Вход = Дата(1,1,1) И НЕ ТекущиеДанные.Выход = Дата(1,1,1) Тогда
		СтруктураОтработано = ЧислоВоВремя(?(ТекущиеДанные.Выход < ТекущиеДанные.Вход,ТекущиеДанные.Выход - ТекущиеДанные.Вход+86400,ТекущиеДанные.Выход - ТекущиеДанные.Вход));
		ТекущиеДанные.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0);
		Если НЕ тзПроходы.Индекс(ТекущиеДанные) = 0 Тогда
			СтруктураОтсутствие = ЧислоВоВремя(?(ТекущиеДанные.Вход - тзПроходы[тзПроходы.Индекс(ТекущиеДанные)-1].Выход < 0,ТекущиеДанные.Вход - тзПроходы[тзПроходы.Индекс(ТекущиеДанные)-1].Выход + 86400,ТекущиеДанные.Вход - тзПроходы[тзПроходы.Индекс(ТекущиеДанные)-1].Выход));  
			тзПроходы[тзПроходы.Индекс(ТекущиеДанные)-1].Отсутствие = Дата(1,1,1,СтруктураОтсутствие.Часы, СтруктураОтсутствие.Минуты,0);
		КонецЕсли;
	КонецЕсли;             
КонецПроцедуры

&НаКлиенте
Процедура тзПроходыВходПриИзменении(Элемент)
	ТекущиеДанные = Элементы.тзПроходы.ТекущиеДанные;        
	ПересчитатьСтрокуВход(ТекущиеДанные);       
	ПересчитатьИтоги();
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьСтроку(ТекущиеДанные) 
	Если НЕ ТекущиеДанные.Вход = Дата(1,1,1) И НЕ ТекущиеДанные.Выход = Дата(1,1,1) Тогда
		СтруктураОтработано = ЧислоВоВремя(?(ТекущиеДанные.Выход < ТекущиеДанные.Вход,ТекущиеДанные.Выход - ТекущиеДанные.Вход+86400,ТекущиеДанные.Выход - ТекущиеДанные.Вход));
		ТекущиеДанные.Отработано = Дата(1,1,1,СтруктураОтработано.Часы, СтруктураОтработано.Минуты,0);
		Если НЕ тзПроходы.Индекс(ТекущиеДанные) = тзПроходы.Количество() - 1 Тогда
			СтруктураОтсутствие = ЧислоВоВремя(?(тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход < 0,тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход + 86400,тзПроходы[тзПроходы.Индекс(ТекущиеДанные)+1].Вход - ТекущиеДанные.Выход));  
			ТекущиеДанные.Отсутствие = Дата(1,1,1,СтруктураОтсутствие.Часы, СтруктураОтсутствие.Минуты,0);
		КонецЕсли;
	КонецЕсли;             
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоги()               
	Если тзПроходы.Количество() = 0 Тогда
		Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыВход.ТекстПодвала = "";  
		Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыВыход.ТекстПодвала = "";  
		Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыОтсутствие.ТекстПодвала = "";  
		Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыОтработано.ТекстПодвала = "";       
		Отработано = 0;       
		ОтработанноеВремя = Дата(1,1,1);
	Иначе		
		Если НЕ тзПроходы[0].Вход = Дата(1,1,1) Тогда
			Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыВход.ТекстПодвала = Формат(тзПроходы[0].Вход,"ДФ=Ч:мм");  
		КонецЕсли;
		Если НЕ тзПроходы[тзПроходы.Количество()-1].Выход = Дата(1,1,1) Тогда
			Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыВыход.ТекстПодвала = Формат(тзПроходы[тзПроходы.Количество()-1].Выход,"ДФ=Ч:мм");  
		КонецЕсли;
		Для Индекс = 0 По  тзПроходы.Количество()-1 Цикл     
			тзПроходы[Индекс].Номер = Индекс + 1;	
			ПересчитатьСтроку(тзПроходы[Индекс]);
			Если Индекс = 0 Тогда
				Отсутствие = тзПроходы[Индекс].Отсутствие;
				ОтработаноИтог = тзПроходы[Индекс].Отработано;
			Иначе
				Отсутствие = Отсутствие + (тзПроходы[Индекс].Отсутствие - Дата(1,1,1));
				ОтработаноИтог = ОтработаноИтог + (тзПроходы[Индекс].Отработано - Дата(1,1,1));
			КонецЕсли;
		КонецЦикла;
		Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыОтсутствие.ТекстПодвала = Формат(Отсутствие,"ДФ=Ч:мм");  
		Элементы.тзПроходы.ПодчиненныеЭлементы.тзПроходыОтработано.ТекстПодвала = Формат(ОтработаноИтог,"ДФ=Ч:мм");  
		Строка = тзИтоги[0];
		Если ОтработаноИтог- Дата(1,1,1,8,0,0)>0 Тогда              
			Если Смена = Перечисления.СостояниеТабеля.РабочийДень ИЛИ Смена =Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда
				ПереработкаСтруктура = ЧислоВоВремя(ОтработаноИтог - Дата(1,1,1,8,0,0)); 
				Строка.Переработка = Дата(1,1,1,ПереработкаСтруктура.Часы,ПереработкаСтруктура.Минуты,0); 
			Иначе		
				Строка.Переработка = ЭтотОбъект.ОтработанноеВремя; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Строка = тзИтоги[0];
	Если ОтработаноИтог- Дата(1,1,1,8,0,0)>0 Тогда              
		Если Смена = Перечисления.СостояниеТабеля.РабочийДень ИЛИ Смена =Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда
			ПереработкаСтруктура = ЧислоВоВремя(ОтработаноИтог - Дата(1,1,1,8,0,0)); 
			Строка.Переработка = Дата(1,1,1,ПереработкаСтруктура.Часы,ПереработкаСтруктура.Минуты,0); 
		Иначе		
			Строка.Переработка = ЭтотОбъект.ОтработанноеВремя; 
		КонецЕсли;      
	Иначе
		Строка.Переработка = Дата(1,1,1); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тзПроходыПослеУдаления(Элемент)
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура тзИтогиСменаПриИзменении(Элемент)   
	Если Элементы.тзИтоги.ТекущиеДанные.Заголовок = "СКУД" Тогда
		Если Элементы.тзИтоги.ТекущиеДанные.Смена = Перечисления.СостояниеТабеля.РабочийДень Тогда
			Элементы.ГруппаПроходы2.Видимость = Ложь;                    
			ТипСмены = Перечисления.СостояниеТабеля.РабочийДень;
		ИначеЕсли Элементы.тзИтоги.ТекущиеДанные.Смена = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена Тогда		     
			Элементы.ГруппаПроходы2.Видимость = Истина;
			ТипСмены = Перечисления.СостояниеТабеля.РабочийДеньНочнаяСмена;
		КонецЕсли;    
	ИначеЕсли Элементы.тзИтоги.ТекущиеДанные.Заголовок = "Табель" Тогда  
		Смена = Элементы.тзИтоги.ТекущиеДанные.Смена;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма);      
	КаталогФото = "\\srvbase-sk\1C_base\ExtForms\FotoSklad\";    
	ПутьКФайлу = КаталогФото+Сотрудник+".jpg";
	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда
		НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКФайлу, Ложь, УникальныйИдентификатор); 
	Иначе
		Элементы.СсылкаНаКартинку.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	СсылкаНаКартинку = Адрес; 
	Модифицированность = Истина; 
КонецПроцедуры
